# 4: Practice

In this exercise, you will practice aggregating and summarizing data with Pandas `groupby` and `pivot_table` and merging/joining datasets using Pandas `concat` and `merge`.

You can either print answers directly from your code or write them in the markdown cells below your code. Either way, make sure that your answers are visible and can be easily read in the final notebook you turn in.

In [1]:
# Here are the needed imports, make sure to run this cell
import seaborn as sns
import pandas as pd
import numpy as np

## Part 1: Summarizing Data
In this part we will start by working with the `seaborn` `planets` dataset. Seaborn is a library for data visualization in Python (already included in your Anaconda distribution) to which we will be returning soon. For now, we are just using it for easy access to the `planets` dataset containing information about 1,035 extrasolar planets that have been discovered by Astronomers over the last several years. As an aside, extrasolar planet discovery is an excellent example of how data science can help fuel discovery in the sciences by automating the analysis of large quantities of data, in this case from telescopes. If you're interested (not necessary to complete this assignment), you can read more at https://exoplanets.nasa.gov, from which this dataset was originally drawn.

To begin, run the following code to import the dataset into the `planets` DataFrame and preview the first five rows.

In [2]:
# Run but do not modify this code
planets = sns.load_dataset('planets')
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

### Question 1
Use Pandas `groupby` operations to answer the following. You might find the function [Series.idxmax](https://pandas.pydata.org/docs/reference/api/pandas.Series.idxmax.html) useful.

1. If you run the code `planets.groupby("number").count()` you will see different values for the different columns. Why is that? Put your answer in "Answer q1_1" cell.
2. What are the two `method`s that account for the most discoveries? How many discoveries were made with those `method`s? Put your answer in `q1_2`. It should have the type `Series` and the index value is the method and the corresponding data is the number of discoveries. You should be able to create this by indexing into the `GroupBy` object to select the correct rows and columns.
3. In which years were more than 100 discoveries made? Put your answer in `q1_3`. It should be the type `numpy.ndarray`.
4. Which `method` has found the most distant exoplanets on average (i.e., the `distance` column), and what is that average distance? Put the method name (string) in `q1_4_1` and the average distance (float) in `q1_4_2`.
5. Which `method` has found the single most distant exoplanet in the dataset, and what `distance` is that exoplanet? Put the method name (string) in `q1_5_1` and the average distance (float) in `q1_5_2`.

<!-- BEGIN QUESTION -->

<!--
BEGIN QUESTION
name: q1_1_manual
manual: true
points: 4
-->

### Answer q1_1

There are different values for different columns because the call $\textbf{count()}$ does not include null values in the count. So if a row had a null value in one column but not the other, the count would only increment in the column without a null value.

<!-- END QUESTION -->

<!--
BEGIN QUESTION
name: q1
manual: false
points:
    - 1
    - 1
    - 1
    - 1
    - 2
    - 2
    - 1
    - 1
    - 1
    - 1
    - 1
    - 1
    - 1
    - 1
-->

In [3]:
# Put your code to answer the question here
# Feel free to add additional cells
planmeth = planets.groupby(by=['method']).count()
q1_2 = planmeth['number'].nlargest(2)

planyear = planets.groupby(by=['year']).count()
q1_3 = planyear.loc[planyear['number'] > 100].index.values

avgmeth = planets.groupby(by=['method']).mean()['distance'].nlargest(1)
q1_4_1 = list(avgmeth.index.values)[0]
q1_4_2 = avgmeth.loc['Microlensing']

maxmeth = planets.groupby(by=['method']).max()['distance'].nlargest(1)
q1_5_1 = list(maxmeth.index.values)[0]
q1_5_2 = maxmeth.loc['Transit']

### Question 2
Next we will work with the titanic dataset which contains historical information about the passengers of the cruiseship *Titanic* that sank in the North Atlantic in 1912. Import the dataset and preview the first few rows below.

In [4]:
# Run but do not modify this code
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

Use Pandas `pivot_table`s to answer the following.

1. Create a DataFrame with the average fare paid by passengers grouped by each combination of `sex` and `class`. Put the result in `q2_1`, the column should be `class` and index should be `sex`.

2. Create a DataFrame with the number of passengers grouped by each combination of `class` and `embark_town`. Put the result in `q2_2`, the column should be `embark_town` and index should be `class`.

3. Create a DataFrame with the fraction of passengers who survived (i.e., `survived==1`) grouped by each combination of `sex`, `class`, and `embark_town`. Put the result in `q2_3`, the column should be `embark_town` and indices should be `sex` and `class`.
  1. For example, if there are four individuals of a given `sex`, `class`, and `embark_town`, and three of the four survived, the value for that combination would be `0.75`.

4. Create a DataFrame with the average `age` and the total `fare` paid by passengers grouped by each combination of `class` and `sex`. `age` should be first and `fare` second. Put the result in `q2_4`, the column should be sex (for average `age` and the total `fare` respectively) and index should be class.
  1. For example, if there were just 2 passengers with `class==first` and `sex==male` aged `20` and `30` and having paid `fare`s of `50` and `70` each, then the average age of that combination would be `25` and the total `fare` paid would be `120`.

In [5]:
# Put your code to answer the question here
# Feel free to add additional cells, especially 
# for displaying tables
q2_1 = titanic.groupby(['sex', 'class'])['fare'].aggregate('mean').unstack()
q2_2 = titanic.groupby(['class', 'embark_town'])['embark_town'].aggregate('count').unstack()
q2_3 = titanic.groupby(['sex','class', 'embark_town'])['survived'].aggregate('mean').unstack()
q2_4 = titanic.pivot_table(index='class', columns='sex',
                    aggfunc={'age':'mean', 'fare':sum})

## Part 2: Merging Data

We begin by studying four tips files included with this practice: `tips_Thur.csv`, `tips_Fri.csv`, `tips_Sat.csv`, and `tips_Sun.csv`. Each contains information about tips received by servers at a restaurant on the particular days of the week denoted by the file names (Thur for Thursday, Fri for Friday, Sat for Saturday, and Sun for Sunday). Below, we import and preview one of the datasets.

In [6]:
# Run but do not modify this code
Thur = pd.read_csv("tips_Thur.csv")
Thur.head()

   total_bill   tip   sex smoker   time  size
0       27.20  4.00  Male     No  Lunch     4
1       22.76  3.00  Male     No  Lunch     2
2       17.29  2.71  Male     No  Lunch     2
3       19.44  3.00  Male    Yes  Lunch     2
4       16.66  3.40  Male     No  Lunch     2

### Question 3
Answer the following questions using the four tips datasets. You will need to combine (using Pandas `concat`) the datasets to answer some of the questions. Furthermore, some of the questions will require information about the day, which is only contained in the file names (though you are welcome to add additional columns to the datasets if you wish).  

1. What is the average overall `total_bill` including data from all four days? Put your answer in `q3_1` (float).
2. For each of the four days, what is the average `tip` for that day? Put your answer in `q3_2`. It should have the type `Series` and the index value is the day ('Thur', 'Fri', etc.) and the corresponding data is the average tip for that day. You should be able to create this by column indexing the `GroupBy` object.
3. Create a pivot table that shows the average ratio of `tip` to `total_bill` (e.g., if a `tip` is `4` and the `total_bill` is `20`, then the ratio would be `0.2`) grouped by `sex` and day. Put the resulting DataFrame in `q3_3`, the column should be day and index should be sex. You may want to use Pandas `pivot_table` to answer this question.

In [7]:
# Put your code to answer the question here
# Feel free to add additional cells, especially 
Fri = pd.read_csv("tips_Fri.csv")
Sat = pd.read_csv("tips_Sat.csv")
Sun = pd.read_csv("tips_Sun.csv")
days = [Thur, Fri, Sat, Sun]

q3_1 = sum([day['total_bill'].sum() for day in days])/sum([len(day['total_bill']) for day in days])

Fri['day'] = 'Fri'
Thur['day'] = 'Thur'
Sat['day'] = 'Sat'
Sun['day'] = 'Sun'
superDF = pd.concat(days)

q3_2 = superDF.groupby(['day'])['tip'].aggregate('mean')

finDF = superDF
finDF['tip'] = finDF['tip']/finDF['total_bill']
q3_3 = finDF.pivot_table(values = 'tip', index='sex', columns='day',
                    aggfunc='mean')
print(q3_3)

day          Fri       Sat       Sun      Thur
sex
Female  0.199388  0.156470  0.181569  0.157525
Male    0.143385  0.151577  0.162344  0.165276

### Question 4
In this question we will work with movie rating data in three different tables/dataframes. You will need to `merge` information from the different tables to answer the questions below. First we import and preview the tables.

In [8]:
# Run but do not modify this code
users = pd.read_csv("users.csv")
users.head()

   user_id  age sex  occupation
0        1   24   M  technician
1        2   53   F       other
2        3   23   M      writer
3        4   24   M  technician
4        5   33   F       other

In [9]:
# Run but do not modify this code
ratings = pd.read_csv("ratings.csv")
ratings.head()

   user_id  movie_id  rating
0      196       242       3
1      186       302       3
2       22       377       1
3      244        51       2
4      166       346       1

In [10]:
# Run but do not modify this code
movies = pd.read_csv("movies.csv")
movies.head()

   movie_id        movie_title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

Answer the following. 

1. How many movies have been rated at least 100 times? Put the answer in `q4_1` (numpy.int64 or int).
2. Which five users have given the highest average ratings? List their `user_id`s and their average `rating`s. Put the answer in `q4_2`. It should have the type `Series` and the index value is the user_id and the corresponding data is the average rating for that user.
3. Create a pivot table that displays average `rating`s grouped by `sex` and `occupation`. Put the answer table in `q4_3`, the column should be sex and index should be occupation.

In [11]:
#make master table
df = pd.merge(users, ratings)
df1 = pd.merge(df, movies)
df1.head()

   user_id  age sex  occupation  movie_id  rating                 movie_title
0        1   24   M  technician        61       4  Three Colors: White (1994)
1       13   47   M    educator        61       4  Three Colors: White (1994)
2       18   35   F       other        61       4  Three Colors: White (1994)
3       58   27   M  programmer        61       5  Three Colors: White (1994)
4       59   49   M    educator        61       4  Three Colors: White (1994)

In [12]:
# Put your code to answer the question here
# Feel free to add additional cells
movId = df1.groupby(by=["movie_id"]).count()
q4_1 = len(movId.loc[movId['user_id'] > 99])

avgR = df1.groupby(by=['user_id']).mean()['rating']
q4_2 = avgR.nlargest(5)

q4_3 = df1.pivot_table(values = 'rating', index = 'occupation', columns = 'sex', aggfunc = 'mean')

### Question 5
We will work with the `restaurants_a.csv` and `restaurants_b.csv` datasets for this question. Each contain five columns: `id` (a numeric index serving as a unique id, not correlated across the datasets), `name` (of the restaurant), `address` (the street address), `city`, and `type` (the type of restaurant). First we import and preview the data.

In [13]:
# Run but do not modify this code
df_a = pd.read_csv("restaurants_A.csv")
df_a

,id,name,address,city,type
0,0,belvedere the,9882 little santa monica blvd.,beverly hills,pacific new wave
1,1,triangolo,345 e. 83rd st.,new york,italian
2,2,broadway deli,3rd st. promenade,santa monica,american
3,3,lettuce souprise you (at),3525 mall blvd.,duluth,cafeterias
4,4,otabe,68 e. 56th st.,new york,asian
...,...,...,...,...,...
181,655,tavern on the green,in central park at 67th st.,new york,american
182,661,cafe des artistes,1 w. 67th st.,new york city,french (classic)
183,756,park avenue cafe (new york city),100 e. 63rd st.,new york city,american (new)
184,758,brasserie le coze,3393 peachtree rd. lenox square mall near ne...,atlanta,french
185,836,cafe lalo,201 w. 83rd st.,new york city,coffeehouses

In [14]:
# Run but do not modify this code
df_b = pd.read_csv("restaurants_B.csv")
df_b

,id,name,address,city,type
0,22,indigo coastal grill,1397 n. highland ave.,atlanta,eclectic
1,54,aqua,252 california st.,san francisco,american (new)
2,89,boulevard,1 mission st.,san francisco,american (new)
3,150,khan toke thai house,5937 geary blvd.,san francisco,thai
4,151,bacchanalia,3125 piedmont rd. near peachtree rd.,atlanta,international
...,...,...,...,...,...
176,801,cafe des artistes,1 w. 67th st.,new york,continental
177,828,uncle nick's,747 ninth ave.,new york city,greek
178,851,brasserie le coze,3393 peachtree rd.,atlanta,french bistro
179,852,postrio,545 post st.,san francisco,californian
180,853,cafe lalo,201 w. 83rd st.,new york,coffee bar

Some, but not all, of the restaurants in the two datasets are actually the same. In this question, we would like to consider the problem of merging the datasets. Unfortunately, the `id`s do not correspond between the datasets, so there is no obvious primary key to merge on. In this question, you will explore a fuzzy matching to link the records between the two datasets. You will be asked to use the `edit_dist` function, but you do not need to implement it. An implementation is provided for you in `edit_distance.py`, and you can simply import the function below. It takes two strings as input and returns the edit distance between them.

In [15]:
# Run but do not modify this code
from edit_distance import edit_dist

# Example of using the edit_dist function
print(edit_dist("hello", "hallo!"))

2

Answer the following.

1. First, try to perform an inner merge (the default for Pandas `merge`) on the two datasets on the `name` column. How many rows are in the resulting merged dataset? Put your answer in `q5_1`. Why is this value much smaller than the sizes of `df_a` and `df_b`? Put your answer in the "Answer q5" cell.
2. Next, try to perform an inner merge on the two datasets on the `city` column. How many rows are in the resulting merged dataset? Put your answer in `q5_2`. Why is this value much larger than the sizes of `df_a` and `df_b`? Put your answer in the "Answer q5" cell.
3. Find the names of all pairs of records (one from `df_a` and the other from `df_b`) such that the two names have edit distance of 1 or 2 (note that if two strings have edit distance 0, they are exactly the same; you do not need to log these). It is fine to use `for` loops to solve this and your code may take a second or two to run. Put your answer in `q5_3`, it should be a set of tuples (name_a, name_b).
4. Among the names you identified in step 3, which pairs do you think are actually mispellings, and which do you think might actually be different restaurants? Explain your answer using information from other columns beside `name`. Feel free to add additional cells to write code. Put your answer in the "Answer q5" cell.

In [18]:
# Put your code to answer the question here
# Feel free to add additional cells
q5_1 = len(pd.merge(df_a, df_b, on = 'name'))
print(q5_1)
q5_2 = len(pd.merge(df_a, df_b, on = 'city'))
print(q5_2)

aName = set(df_a['name'].tolist())
bName = set(df_b['name'].tolist())
opt = set()
allNames = []
for i in aName:
    for j in bName:
        dist = edit_dist(i,j)
        if dist == 1 or dist == 2:
            opt.add((i,j))
            allNames.append(i)
            allNames.append(j)
            
q5_3 = opt
print(q5_3)

43
4887
{('uncle nicks', "uncle nick's"), ('drago', 'spago'), ('boulavard', 'boulevard'), ('mesa grill', 'sea grill'), ('felidia', 'filidia'), ('march', 'marichu'), ('indigo coast grill', 'indigo coastal grill'), ("l'orangerie", 'l orangerie')}

In [17]:
for i in range(len(allNames)):
    if i%2 == 0:
        print(df_a.loc[df_a['name'] == allNames[i]][['name', 'city', 'type']])
    else:
        print(df_b.loc[df_b['name'] == allNames[i]][['name', 'city', 'type']])

      name          city     type
121  drago  santa monica  italian
     name         city         type
75  spago  los angeles  californian
           name           city          type
174  mesa grill  new york city  southwestern
         name      city     type
84  sea grill  new york  seafood
            name      city           type
180  uncle nicks  new york  mediterranean
             name           city   type
177  uncle nick's  new york city  greek
         name           city      type
60  boulavard  san francisco  american
        name           city            type
2  boulevard  san francisco  american (new)
           name          city              type
11  l'orangerie  w. hollywood  french (classic)
            name         city    type
137  l orangerie  los angeles  french
        name           city     type
161  felidia  new york city  italian
        name      city     type
114  filidia  new york  italian
                  name     city       type
12  indigo coast grill  atlanta  caribbean
                   name     city      type
0  indigo coastal grill  atlanta  eclectic
      name           city            type
163  march  new york city  american (new)
       name      city    type
18  marichu  new york  french

<!-- BEGIN QUESTION -->

<!--
BEGIN QUESTION
name: q5_manual
manual: true
points: 8
-->

### Answer q5

##### Q5 P1

This is much smaller than the sizes of df_a and df_b because the merge only outputs one row when df_a and df_b both contained restaurants with the same name. Basically this is the number of duplicate restaurant entries (or just two restaurants who happen to have the exact same name) across the two tables. This is a one-to-one mapping (assuming no two restaurants in a table have the same name). 

##### Q5 P2

The length of this merge is much larger than the lengths of df_a and df_b because many restaurants can exist in the same city, so we have a many-to-one mapping for a lot of these restaurants. For example, if restaurant A is in city 'new york,' there will be rows matching it to every restaurant in df_b that are also in city 'new york.'

##### Q5 P4

I think that uncle nicks vs uncle nick's is a misspelling, because both are mediterranean/greek restaurants in NYC so it is likely they are both owned by the same people. I think drago and spago are actually different restaurants because they are in different parts of California and drago is italian while spago is californian. I think that felidia vs filidia is a misspelling, because both are italian restaurants in nyc. I think march and marichu are different restaurants because even though they are in the same city, one is french and one is american. I think l'orangerie and l orangerie are the same, because they are both french restaurants in california and one is just missing the appostrophe. Mesa grill and sea grill are different restaurants because one is seafood and one is southwestern food. I think boulavard vs boulevard is a misspelling because both are american food in san fracisco.